clear;clc;close;
%灰度关联分析——任意向量与向量之间的关系，矩阵与矩阵之间关系
%控制输出结果精度
format short
%输入矩阵——行为变量
%参考数列
X=[
308.58 310 295 346 367;
195.4  189.9  187.2  205  222.7    
24.6  21  12.2  15.1  14.57    
20  25.6  23.3  29.2  30    
18.98  19  22.3  23.5  27.655];
%比较数列
Y=[
170  174  197  216.4  235.8    
57.55  70.74  76.8  80.7  89.85    
88.56  70  85.38  99.83  103.4    
11.19  13.28  16.82  18.9  22.8    
4.03  4.26  4.34  5.06  5.78    
13.7  15.6  13.77  11.98  13.95];
%% 
%数据标准化
[n1,m1]=size(X);[n2,m2]=size(Y);
for i=1:n1
    X0(i,:)=X(i,:)/mean(X(i,:));
    % X0(i,:)=X(i,:)/X(i,1);
end
for i=1:n2
    Y0(i,:)=Y(i,:)/mean(Y(i,:));
    % Y0(i,:)=Y(i,:)/Y(i,1);
end
%关联度计算
rho=0.5;
for j=1:n1
    for i=1:n2
      temp=abs(X0(j,:)-Y0);
      min2=min(min(temp));
      max2=max(max(temp));
     for k=1:m1
          xi(k)=(min2+rho*max2)/(abs(X0(j,k)-Y0(i,k))+rho*max2);
     end
     r(i,j)=mean(xi);
    end
end
%% 输出与结果显示
r
bar(r,0.90);
axis tight;
legend('固定资产投资','工业投资','农业投资','科技投资','交通投资');% 图例

%x轴添加汉字标签
%先去掉x轴的固有标签，再用文本标注x轴
% 定义x轴上的类别  
categories = {'国民收入', '工业收入', '农业收入', '商业收入', '交通收入', '建筑业收入'};  
% 定义每个类别的收入值  
values = [1000, 1500, 700, 1200, 900, 800];  
% 设置x轴的标签  
set(gca, 'XTickLabel', categories);  
%添加标题和轴标签  
title('投资对收入的作用');  
xlabel('收入');  
ylabel('作用效果');
