clear,clc;
%输入矩阵
%如果想设置一个从a开始比较的指标可以增添一个为a的方案，其余项取最劣值.
% 该方案为调节方案，调节方案的综合评价指数趋于0（该方案一般不采用，直接采用权重向量即可）
A=[
21584   76.7    7.3 1.01    78.3    97.5    2.0
24372   86.3    7.4 0.80    91.1    98.0    2.0
22041   81.8    7.3 0.62    91.1    97.3    3.2
21115   84.5    6.9 0.60    90.2    97.7    2.9
24633   90.3    6.9 0.25    95.5    97.9    3.6
];
%输入评价方案
% 0表示正向指标/效益型，1表示负向指标/成本型，2为区间型
P=[0 1 2 0 1 0 0];
%如果为区间型考虑此矩阵
%从上到下依次为：无法容忍上限、最优上限、最优下限、无法容忍下限
Pi=[
10
7
6
5
];
%权向量(可由层次分析法得出）
W=[3 1 2 2 1 2 1];
W=W/sum(W);
W=W';
% 变异系数法/易变权重
Xbar=mean(A);
S=std(A);
V=S./Xbar;
W=V/sum(V);
W=W';
%%%%%%%%%%%%%
[n,m]=size(A);
%归一化（标准0-1变换与区间变换）
j=1;
for i =1:1:m
    if P(i)==0
        Max=max(A(:,i));
        Min=min(A(:,i));
        A(:,i)=(A(:,i)-Min)./(Max-Min);
    end
    if P(i)==1
        Max=max(A(:,i));
        Min=min(A(:,i));
        A(:,i)=(Max-A(:,i))./(Max-Min);
    end
    if P(i)==2
        %区间变换函数
        f=@(x)(1-(Pi(3,j)-x)./(Pi(3,j)-Pi(4,j))).*(x<Pi(3,j)&x>=Pi(4,j))+(x<Pi(2,j)&x>=Pi(3,j))+(1-(x-Pi(2,j))./(Pi(1,j)-Pi(2,j))).*(x<Pi(1,j)&x>=Pi(2,j));
        A(:,i)=f(A(:,i));
        j=j+1;
    end
end
%规范化
A=A+0.001;%偏移
for i=1:1:n
    for j=1:1:m
        B(i,j)=A(i,j)/norm(A(:,j));
    end
end
%加权化
B=B*W;

%综合评价指数
for i=1:1:n
    d(i)=norm(B(i,:));
end
disp('综合评价指数');
index=d'/norm(d)
sortrows([d'/norm(d),(1:n)'],1,"descend") %排序