clear;clc;
%X1，X2 ...Xk已知变量
A = [  
    0.9 0.34 1.53 1;  
    0.88 0.23 1.67 1;  
    0.92 0.28 1.43 1;  
    0.89 0.14 1.24 1;  
    0.78 0.35 1.8 1;  
    0.81 0.26 2.01 1;  
    0.72 0.18 1.75 1;  
    0.93 0.22 0.99 1;  
    0.82 0.26 1.4 1;  
    0.78 0.27 1.67 0;  
    0.78 0.27 1.53 0;  
    0.72 0.18 1.2 0;  
    0.69 0.16 1.28 0;  
    0.63 0.15 0.88 0;  
    0.58 0.22 1.42 0;  
    0.81 0.18 1.59 0;  
    0.67 0.21 1.21 0;  
    0.65 0.16 1.37 0;
];  
X=A(:,1:end-1);
%已知值
Y=[zeros(9,1);ones(9,1)];
%预测变量
Xval=[
-49.2 -17.2 0.3  
-19.2 -66.7 0.8  
40.6 5.8 1.8  
34.6 26.4 1.8  
19.9 26.7 2.3
];
%%%%%%%%%%%%%%%%%
%映射关系
k=sum(Y)/size(Y,1);
P=@(pi)pi>k;
%数据转化与参数回归
[n,m]=size(X);
Y1=(Y+k)/2; %数据转化，使得值有效
Y0=log(Y1./(1-Y1));
b=regress(Y0,[ones(n,1),X]);
%% 模型预测与结果显示
%预测模型
disp(['回归系数:']),b
f=@(x) exp(x*b)./(exp(x*b)+1);
[n0,m0]=size(Xval);
disp(['预测概率:']);
pi=f([ones(n0,1),Xval])
disp(['预测值:']);
Yval=P(pi)'
%误差分析
disp(['标准预测值:']);
Yp=P(f([ones(n,1),X]));Yp'
disp(['标准误差率:',num2str(sum(abs(Y-Yp))/n*100),'%']);
%拟合优度
e=Yp-Y;
Ybar=mean(Y);
p=m;
disp('总平方和:'),TSS=sum((Y-Ybar).^2)
disp('残差平方和:'),RSS=sum(e.^2)
disp('决定系数:'),R=sqrt(1-RSS/TSS)
disp('校正决定系数:'),R_adjusted=1-(1-R^2)*(n-1)/(n-p-1)
