clear;clc;
%X1，X2 ...Xk已知变量
X=[
-62.8 -89.5 1.7  
-3.3 -3.5 1.1  
-120.8 -103.2 2.5  
-18.1 -28.8 1.1  
-3.8 -50.6 0.9  
-61.2 -56.2 1.7  
-20.3 -17.4 1  
-194.5 -25.8 0.5  
20.8 -4.3 1  
-106.1 -22.9 1.5  
43 16.4 1.3  
47 16 1.9  
-3.3 4 2.7  
35 20.8 1.9  
46.7 12.6 0.9   
20.8 12.5 2.4  
33 23.6 1.5  
26.1 10.4 2.1  
68.6 13.8 1.6 
37.3 33.4 3.5
];
%已知值
Y=[zeros(10,1);ones(10,1)];
%预测变量
Xval=[
-49.2 -17.2 0.3  
-19.2 -66.7 0.8  
40.6 5.8 1.8  
34.6 26.4 1.8  
19.9 26.7 2.3
];
%%%%%%%%%%%%%%%%%
%映射关系
k=sum(Y)/size(Y,1);
P=@(pi)pi>k;
%数据转化与参数回归
[n,m]=size(X);
Y1=(Y+k)/2; %数据转化，使得值有效
Y0=log(Y1./(1-Y1));
b=regress(Y0,[ones(n,1),X]);
%% 模型预测与结果显示
%预测模型
disp(['回归系数:']),b
f=@(x) exp(x*b)./(exp(x*b)+1);
[n0,m0]=size(Xval);
disp(['预测概率:']);
pi=f([ones(n0,1),Xval])
disp(['预测值:']);
Yval=P(pi)'
%误差分析
disp(['标准预测值:']);
Yp=P(f([ones(n,1),X]));Yp'
disp(['标准误差率:',num2str(sum(abs(Y-Yp))/n*100),'%']);
%拟合优度
e=Yp-Y;
Ybar=mean(Y);
p=m;
disp('总平方和:'),TSS=sum((Y-Ybar).^2)
disp('残差平方和:'),RSS=sum(e.^2)
disp('决定系数:'),R=sqrt(1-RSS/TSS)
disp('校正决定系数:'),R_adjusted=1-(1-R^2)*(n-1)/(n-p-1)
