clear;clc;
% 给定矩阵A  
A = [  
    0.9 0.34 1.53 1;  
    0.88 0.23 1.67 1;  
    0.92 0.28 1.43 1;  
    0.89 0.14 1.24 1;  
    0.78 0.35 1.8 1;  
    0.81 0.26 2.01 1;  
    0.72 0.18 1.75 1;  
    0.93 0.22 0.99 1;  
    0.82 0.26 1.4 1;  
    0.78 0.27 1.67 -1;  
    0.78 0.27 1.53 -1;  
    0.72 0.18 1.2 -1;  
    0.69 0.16 1.28 -1;  
    0.63 0.15 0.88 -1;  
    0.58 0.22 1.42 -1;  
    0.81 0.18 1.59 -1;  
    0.67 0.21 1.21 -1;  
    0.65 0.16 1.37 -1  
];  
  
% 分离特征和标签  
X = A(:, 1:end-1); % 提取特征  
y = A(:, end);     % 提取类别标签  
  
% 训练SVM模型  
%fitcsvm 是 MATLAB 中用于训练支持向量机 (SVM) 分类模型的函数。
%fitcsvm 函数提供了多种选项来调整 SVM 模型的训练过程，包括选择核函数、设置正则化
% 参数、指定优化算法等。这使得用户可以根据具体的应用场景和数据特性来定制最适合的
% SVM 模型。
SVMModel = fitcsvm(X, y);  
  
% 使用SVM模型进行预测  
% 假设你想预测一个新样本newSample的类别 
for i=1:size(A)
newSample = A(i,1:end-1);  
predictedLabel = predict(SVMModel, newSample);  
yp(i,1)=predictedLabel;
% 显示预测结果  
end
disp('最终结果');[y,yp]
disp('误差度%:');sum(abs(yp-y)/2)/size(A,1)*100